Documents/ФормированиеДвиженийПоМСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ФормированиеДвиженийПоМСФО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийФормированияДвиженийМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтатейДР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦФОСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦФОСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийФормированияДвиженийМСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийФормированияДвиженийМСФО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УчетИнвестицийПоРемонтуПомещений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетОбязательствПоАренде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторноНачисленийПоАренде</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторонняяРозница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладСтороннейРозницы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ФормированиеДвиженийПоМСФО/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ЭтотОбъект.Движения.Финансовый.Записывать = Истина;
	ЭтотОбъект.Движения.Финансовый.Очистить();
	Движения.Финансовый.Записать();
	
	Если ВидОперации = Перечисления.ВидыОперацийФормированияДвиженийМСФО.УчетИнвестицийПоРемонтуПомещений Тогда
		СЗ_Инвестиции = Новый СписокЗначений;
		СЗ_Инвестиции.ЗагрузитьЗначения(СписокСтатейДР.ВыгрузитьКолонку("Статья"));
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("Дата2", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Дата3", КонецМесяца(Дата) + 1);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Инвестиции", СЗ_Инвестиции);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Организация,
		               |	ВложенныйЗапрос.СубконтоДт1,
		               |	ВложенныйЗапрос.СчетКт,
		               |	ВложенныйЗапрос.СубконтоКт1,
		               |	ВложенныйЗапрос.СубконтоКт2,
		               |	ВложенныйЗапрос.СубконтоКт3,
		               |	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		               |	СУММА(ВложенныйЗапрос.СуммаМСФО) КАК СуммаМСФО,
		               |	ВложенныйЗапрос.БудетЗакрыто
		               |ПОМЕСТИТЬ Данные
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ФинансовыйОбороты.Организация КАК Организация,
		               |		ВЫБОР
		               |			КОГДА ФинансовыйОбороты.Субконто1 В
		               |					(ВЫБРАТЬ
		               |						СтруктурныеЕдиницы.Ссылка
		               |					ИЗ
		               |						Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		               |					ГДЕ
		               |						СтруктурныеЕдиницы.ЗапрещеноВыбиратьКакЦфоВПроводки)
		               |				ТОГДА ФинансовыйОбороты.Субконто3
		               |			ИНАЧЕ ФинансовыйОбороты.Субконто1
		               |		КОНЕЦ КАК СубконтоДт1,
		               |		ФинансовыйОбороты.Счет КАК СчетКт,
		               |		ФинансовыйОбороты.Субконто1 КАК СубконтоКт1,
		               |		ФинансовыйОбороты.Субконто2 КАК СубконтоКт2,
		               |		ФинансовыйОбороты.Субконто3 КАК СубконтоКт3,
		               |		ФинансовыйОбороты.СуммаОборот КАК Сумма,
		               |		ФинансовыйОбороты.СуммаМСФООборот КАК СуммаМСФО,
		               |		ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.СтруктурныеЕдиницы).Ссылка <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |			И (ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.СтруктурныеЕдиницы).ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		               |				ИЛИ ВЫРАЗИТЬ(ФинансовыйОбороты.Субконто1 КАК Справочник.СтруктурныеЕдиницы).БратьВРаспределениеЗатрат = ИСТИНА) КАК БудетЗакрыто
		               |	ИЗ
		               |		РегистрБухгалтерии.Финансовый.Обороты(
		               |				&Дата1,
		               |				&Дата2,
		               |				,
		               |				Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ЗатратыТочекДляРаспределения),
		               |				,
		               |				Субконто2 В (&Инвестиции)
		               |					И Организация = &Организация,
		               |				КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ЗатратыТорговыхТочек),
		               |				) КАК ФинансовыйОбороты) КАК ВложенныйЗапрос
		               |ГДЕ
		               |	ВложенныйЗапрос.СубконтоДт1.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.Организация,
		               |	ВложенныйЗапрос.СубконтоДт1,
		               |	ВложенныйЗапрос.СчетКт,
		               |	ВложенныйЗапрос.СубконтоКт1,
		               |	ВложенныйЗапрос.СубконтоКт2,
		               |	ВложенныйЗапрос.СубконтоКт3,
		               |	ВложенныйЗапрос.БудетЗакрыто
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Данные.Организация,
		               |	Данные.СубконтоДт1,
		               |	Данные.СчетКт,
		               |	Данные.СубконтоКт1,
		               |	Данные.СубконтоКт2,
		               |	Данные.СубконтоКт3,
		               |	Данные.Сумма,
		               |	Данные.СуммаМСФО,
		               |	Данные.БудетЗакрыто
		               |ИЗ
		               |	Данные КАК Данные
		               |ГДЕ
		               |	((ВЫРАЗИТЬ(Данные.СубконтоДт1.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(Данные.СубконтоДт1.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |АВТОУПОРЯДОЧИВАНИЕ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВложенныйЗапрос.ТТ,
		               |	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		               |	СУММА(ВложенныйЗапрос.Амортизация) КАК Амортизация,
		               |	ЕСТЬNULL(ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО, ВложенныйЗапрос.ТТ) КАК ЦФО
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ФинансовыйОстатки.Субконто1 КАК ТТ,
		               |		ФинансовыйОстатки.СуммаМСФООстаток КАК Сумма,
		               |		0 КАК Амортизация
		               |	ИЗ
		               |		РегистрБухгалтерии.Финансовый.Остатки(&Дата3, Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.АктивПоАрендеРемонтныеРаботы), , Организация = &Организация) КАК ФинансовыйОстатки
		               |	ГДЕ
		               |		ФинансовыйОстатки.СуммаМСФООстаток <> 0
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ФинансовыйОстатки.Субконто1,
		               |		0,
		               |		ФинансовыйОстатки.СуммаМСФООстаток
		               |	ИЗ
		               |		РегистрБухгалтерии.Финансовый.Остатки(&Дата3, Счет = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.АмортизацияРемонтныеРаботы), , Организация = &Организация) КАК ФинансовыйОстатки
		               |	ГДЕ
		               |		ФинансовыйОстатки.СуммаМСФООстаток <> 0
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		Данные.СубконтоДт1,
		               |		Данные.Сумма + Данные.СуммаМСФО,
		               |		0
		               |	ИЗ
		               |		Данные КАК Данные) КАК ВложенныйЗапрос
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦФОСтруктурныхЕдиниц.СрезПоследних(&Дата3, Организация = &Организация) КАК ЦФОСтруктурныхЕдиницСрезПоследних
		               |		ПО ВложенныйЗапрос.ТТ = ЦФОСтруктурныхЕдиницСрезПоследних.СтруктурнаяЕдиница
		               |ГДЕ
		               |	ВЫРАЗИТЬ(ВложенныйЗапрос.ТТ КАК Справочник.СтруктурныеЕдиницы).Ссылка <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |	И ВложенныйЗапрос.ТТ.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.ТТ,
		               |	ЕСТЬNULL(ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО, ВложенныйЗапрос.ТТ)
		               |АВТОУПОРЯДОЧИВАНИЕ";
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Выборка = РезультатЗапроса[1].Выбрать();
		Выборка032 = РезультатЗапроса[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.БудетЗакрыто и Выборка.Сумма <> 0 Тогда
				НоваяПроводка = ЭтотОбъект.Движения.Финансовый.Добавить();
				НоваяПроводка.Период = Дата;
				НоваяПроводка.Содержание = "Учет инвестиций по ремонту помещений";
				НоваяПроводка.Организация = Организация;
				
				НоваяПроводка.СчетДт = ПланыСчетов.Финансовый.ЗатратыТорговыхТочек;
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.СубконтоКт1);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Выборка.СубконтоКт2);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Выборка.СубконтоКт3);
				
				НоваяПроводка.СчетКт = Выборка.СчетКт;
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.СубконтоКт1);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.СубконтоКт2);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.СубконтоКт3);
				
				НоваяПроводка.СуммаМСФО = -Выборка.Сумма;
			КонецЕсли;
			Если Выборка.Сумма + Выборка.СуммаМСФО <> 0 Тогда
				НоваяПроводка = ЭтотОбъект.Движения.Финансовый.Добавить();
				НоваяПроводка.Период = Дата;
				НоваяПроводка.Содержание = "Учет инвестиций по ремонту помещений";
				НоваяПроводка.Организация = Организация;
				
				НоваяПроводка.СчетДт = ПланыСчетов.Финансовый.АктивПоАрендеРемонтныеРаботы;
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.СубконтоДт1);
				
				НоваяПроводка.СчетКт = Выборка.СчетКт;
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.СубконтоКт1);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.СубконтоКт2);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.СубконтоКт3);
				
				НоваяПроводка.СуммаМСФО = Выборка.Сумма + Выборка.СуммаМСФО;
			КонецЕсли;
		КонецЦикла;
		Пока Выборка032.Следующий() Цикл
			Если Выборка032.Сумма - Выборка032.Амортизация > 0 Тогда
				НоваяПроводка = ЭтотОбъект.Движения.Финансовый.Добавить();
				НоваяПроводка.Период = Дата;
				НоваяПроводка.Содержание = "Учет инвестиций по ремонту помещений";
				НоваяПроводка.Организация = Организация;
				
				НоваяПроводка.СчетДт = ПланыСчетов.Финансовый.ЗатратыТочекДляРаспределения;
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка032.ТТ);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, СтатьяАмортизации);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Выборка032.ЦФО);
				
				НоваяПроводка.СчетКт = ПланыСчетов.Финансовый.АмортизацияРемонтныеРаботы;
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка032.ТТ);
				
				НоваяПроводка.СуммаМСФО = Окр(Выборка032.Сумма / 60, 2, 1);
				Если НоваяПроводка.СуммаМСФО > Выборка032.Сумма - Выборка032.Амортизация Тогда
					НоваяПроводка.СуммаМСФО = Выборка032.Сумма - Выборка032.Амортизация;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ВидОперации = Перечисления.ВидыОперацийФормированияДвиженийМСФО.РасчетОбязательствПоАренде Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("Дата2", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде) КАК СчетДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СчетКт КАК СчетКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот) КАК СуммаМСФО
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк)), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетКт
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.Банк)), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетДт
		               |АВТОУПОРЯДОЧИВАНИЕ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяПроводка = ЭтотОбъект.Движения.Финансовый.Добавить();
			НоваяПроводка.Период = Дата;
			НоваяПроводка.Содержание = "Расчет обязательств по аренде";
			НоваяПроводка.Организация = Организация;
			
			НоваяПроводка.СчетДт = Выборка.СчетДт;
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.СубконтоДт1);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Выборка.СубконтоДт2);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Выборка.СубконтоДт3);
			
			НоваяПроводка.СчетКт = Выборка.СчетКт;
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.СубконтоКт1);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.СубконтоКт2);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.СубконтоКт3);
			
			НоваяПроводка.СуммаМСФО = -Выборка.СуммаМСФО;
			
			НоваяПроводка = ЭтотОбъект.Движения.Финансовый.Добавить();
			НоваяПроводка.Период = Дата;
			НоваяПроводка.Содержание = "Расчет обязательств по аренде";
			НоваяПроводка.Организация = Организация;
			
			НоваяПроводка.СчетДт = Выборка.СчетДт1;
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.СубконтоДт1);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Выборка.СубконтоДт2);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Выборка.СубконтоДт3);
			
			НоваяПроводка.СчетКт = Выборка.СчетКт1;
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.СубконтоКт1);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.СубконтоКт2);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.СубконтоКт3);
			
			НоваяПроводка.СуммаМСФО = Выборка.СуммаМСФО;
		КонецЦикла;
	КонецЕсли;
	Если ВидОперации = Перечисления.ВидыОперацийФормированияДвиженийМСФО.СторноНачисленийПоАренде Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("Дата2", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде) КАК СчетДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СчетКт КАК СчетКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ИСТИНА КАК Наоборот,
		               |	ЛОЖЬ КАК ПроводитьНа602Р,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот) КАК СуммаМСФО
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ЗатратыТочекДляРаспределения), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетКт
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ЛОЖЬ,
		               |	ИСТИНА,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ОбеспечительныйВзнос), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетКт
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ЛОЖЬ,
		               |	ИСТИНА,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.НалогиУН), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетДт
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ЛОЖЬ,
		               |	ЛОЖЬ,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ЗатратыТочекДляРаспределения), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетДт
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ЛОЖЬ,
		               |	ЛОЖЬ,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.НалогиСФОТ), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетДт
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ЛОЖЬ,
		               |	ЛОЖЬ,
		               |	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
		               |ИЗ
		               |	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ЗатратыОбщиеДляРаспределения), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
		               |ГДЕ
		               |	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
		               |	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФинансовыйОборотыДтКт.СчетДт,
		               |	ФинансовыйОборотыДтКт.СубконтоДт1,
		               |	ФинансовыйОборотыДтКт.СубконтоДт2,
		               |	ФинансовыйОборотыДтКт.СубконтоДт3,
		               |	ФинансовыйОборотыДтКт.СчетКт,
		               |	ФинансовыйОборотыДтКт.СубконтоКт1,
		               |	ФинансовыйОборотыДтКт.СубконтоКт2,
		               |	ФинансовыйОборотыДтКт.СубконтоКт3,
		               |	ФинансовыйОборотыДтКт.Организация,
		               |	ФинансовыйОборотыДтКт.СчетДт
					   //|
					   //|ОБЪЕДИНИТЬ ВСЕ
					   //|
					   //|ВЫБРАТЬ
					   //|	ФинансовыйОборотыДтКт.СчетДт,
					   //|	ФинансовыйОборотыДтКт.СчетДт,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт3,
					   //|	ФинансовыйОборотыДтКт.СчетКт,
					   //|	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
					   //|	ФинансовыйОборотыДтКт.СубконтоКт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт3,
					   //|	ФинансовыйОборотыДтКт.Организация,
					   //|	ЛОЖЬ,
					   //|	ЛОЖЬ,
					   //|	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
					   //|ИЗ
					   //|	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт.Код = ""60.22"", , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , Организация = &Организация) КАК ФинансовыйОборотыДтКт
					   //|ГДЕ
					   //|	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
					   //|	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
					   //|			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоКт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
					   //|
					   //|СГРУППИРОВАТЬ ПО
					   //|	ФинансовыйОборотыДтКт.СчетДт,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт3,
					   //|	ФинансовыйОборотыДтКт.СчетКт,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт3,
					   //|	ФинансовыйОборотыДтКт.Организация,
					   //|	ФинансовыйОборотыДтКт.СчетДт
					   //|
					   //|ОБЪЕДИНИТЬ ВСЕ
					   //|
					   //|ВЫБРАТЬ
					   //|	ФинансовыйОборотыДтКт.СчетДт,
					   //|	ФинансовыйОборотыДтКт.СчетДт,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт3,
					   //|	ФинансовыйОборотыДтКт.СчетКт,
					   //|	ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыОбязательстваПоАренде),
					   //|	ФинансовыйОборотыДтКт.СубконтоКт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт3,
					   //|	ФинансовыйОборотыДтКт.Организация,
					   //|	ЛОЖЬ,
					   //|	ЛОЖЬ,
					   //|	СУММА(ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот)
					   //|ИЗ
					   //|	РегистрБухгалтерии.Финансовый.ОборотыДтКт(&Дата1, &Дата2, , СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Финансовый.РасчетыПоАренде), , СчетКт.Код = ""60.22"", , Организация = &Организация) КАК ФинансовыйОборотыДтКт
					   //|ГДЕ
					   //|	ФинансовыйОборотыДтКт.СуммаОборот + ФинансовыйОборотыДтКт.СуммаМСФООборот <> 0
					   //|	И ((ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) = ДАТАВРЕМЯ(1, 1, 1)
					   //|			ИЛИ (ВЫРАЗИТЬ(ФинансовыйОборотыДтКт.СубконтоДт3.ДатаЗакрытия КАК ДАТА)) >= &Дата1)
					   //|
					   //|СГРУППИРОВАТЬ ПО
					   //|	ФинансовыйОборотыДтКт.СчетДт,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоДт3,
					   //|	ФинансовыйОборотыДтКт.СчетКт,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт1,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт2,
					   //|	ФинансовыйОборотыДтКт.СубконтоКт3,
					   //|	ФинансовыйОборотыДтКт.Организация,
					   //|	ФинансовыйОборотыДтКт.СчетДт
		               |АВТОУПОРЯДОЧИВАНИЕ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяПроводка = ЭтотОбъект.Движения.Финансовый.Добавить();
			НоваяПроводка.Период = Дата;
			НоваяПроводка.Содержание = "Сторно начислений по аренде";
			НоваяПроводка.Организация = Организация;
			
			НоваяПроводка.СчетДт = Выборка.СчетДт;
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.СубконтоДт1);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Выборка.СубконтоДт2);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Выборка.СубконтоДт3);
			
			НоваяПроводка.СчетКт = Выборка.СчетКт;
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.СубконтоКт1);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.СубконтоКт2);
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.СубконтоКт3);
			
			НоваяПроводка.СуммаМСФО = -Выборка.СуммаМСФО;
			
			Если Выборка.ПроводитьНа602Р Тогда
				НоваяПроводка = ЭтотОбъект.Движения.Финансовый.Добавить();
				НоваяПроводка.Период = Дата;
				НоваяПроводка.Содержание = "Сторно начислений по аренде";
				НоваяПроводка.Организация = Организация;
				
				Если не Выборка.Наоборот Тогда
					НоваяПроводка.СчетДт = Выборка.СчетДт1;
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.СубконтоДт1);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Выборка.СубконтоДт2);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Выборка.СубконтоДт3);
					
					НоваяПроводка.СчетКт = Выборка.СчетКт1;
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.СубконтоКт1);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.СубконтоКт2);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.СубконтоКт3);
				Иначе
					НоваяПроводка.СчетКт = Выборка.СчетДт1;
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.СубконтоДт1);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.СубконтоДт2);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.СубконтоДт3);
					
					НоваяПроводка.СчетДт = Выборка.СчетКт1;
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.СубконтоКт1);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Выборка.СубконтоКт2);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Выборка.СубконтоКт3);
				КонецЕсли;
				
				НоваяПроводка.СуммаМСФО = Выборка.СуммаМСФО;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = КонецМесяца(Дата);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.ВидыОперацийФормированияДвиженийМСФО.УчетИнвестицийПоРемонтуПомещений и СписокСтатейДР.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указаны статьи для закрытия!", Отказ);
	КонецЕсли;
КонецПроцедуры
